app/views/users/show.html.haml

.user_name{style:"width:90%;height:200px;background-color:white;margin-top:70px;margin-left:auto;margin-right:auto;text-align:center;border-radius:10px;line-height:200px;padding-top:30px;"}
	%h1{style:"font-size:80px;"}=User.find(params[:id]).username
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]

	.images{style:"margin-top:80px;"}
		- User.find(params[:id]).pictures.each do |pic|
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ?  ORDER BY "pictures"."id" ASC LIMIT 1  [["user_id", 7]]