app/controllers/competition_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "pictures" SET "elo" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["elo", 1430], ["updated_at", "2015-09-19 18:45:28.745103"], ["id", 7]]
---
	def elo()

		@winner = Picture.find(params[:winner])
		@loser = Picture.find(params[:loser])

		winner_score = @winner.elo
		loser_score = @loser.elo

    expected = 1 / (1 + 10**((loser_score - winner_score)/400))
    mult = 0;

    if (winner_score < 1200)
        mult = 30
    elsif (winner_score < 1600)
        mult = -0.05 *  winner_score + 100
    else
        mult = 10
    end

    elo = (mult * (1 - expected)).round

    @winner.elo = winner_score + elo
    @loser.elo = loser_score - elo

    if @winner.save && @loser.save

SELECT COUNT(*) FROM "pictures"
SELECT "pictures".* FROM "pictures"
SELECT "pictures".* FROM "pictures" WHERE ("pictures"."elo" >= 1350 AND "pictures"."elo" < 1450)
---
	def get_pictures()
		num_pics = Picture.count
		@first_pic = Picture.all[rand(num_pics)]
		@second_pic = nil


		photo_elo = @first_pic.elo.to_i

		elo_search = 50

		until Picture.where(elo: (photo_elo - elo_search)...(photo_elo + elo_search)) && (@second_pic != @first_pic) && @second_pic