app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "fdsafsgdas"], ["email", "chriswissmach@gmail.com"], ["created_at", "2015-09-10 14:18:39.062777"], ["updated_at", "2015-09-10 14:18:39.062777"]]
---
  def create
	@user = User.new(user_params)
	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "pictures" ("user_id", "elo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["elo", 1400], ["created_at", "2015-09-20 02:44:50.165949"], ["updated_at", "2015-09-20 02:44:50.165949"]]
---
  def create_picture
		@picture = Picture.new(picture_params)
		@user = User.find(session[:id])
		@picture.user_id = @user.id
		@picture.elo = 1400
		if @picture.save